In [39]:
import os

In [40]:
#!pip install mysql-connector

In [41]:
#!pip uninstall mysql-connector

In [42]:
#!pip install mysql-connector-python

In [43]:
import mysql.connector

In [44]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [45]:
user_name=os.environ.get('DB_USER')
password=os.environ.get('DB_PASS')

In [46]:
connection=mysql.connector.connect(host='localhost', user="root",password="harinhk",database='imdb',auth_plugin='mysql_native_password')

In [47]:
connection

In [48]:
#DML means data manipulation language #insert, update and delete are DML commands

In [56]:
#DDL commands
#Create, alter, drop, truncate ,rename, truncate, rename

In [57]:
pd.read_sql_query("CREATE TABLE student(sno int, sname varchar(20), age int, dob date)", connection)

DatabaseError: Execution failed on sql 'CREATE TABLE student(sno int, sname varchar(20), age int, dob date)': 1050 (42S01): Table 'student' already exists

In [58]:
pd.read_sql_query("SHOW TABLES FROM imdb", connection)

     Tables_in_imdb
0            actors
1         directors
2  directors_genres
3        helloworld
4            movies
5  movies_directors
6     movies_genres
7             roles
8           student

In [59]:
pd.read_sql_query("SELECT * FROM student", connection)

Empty DataFrame
Columns: [sno, sname, age, dob]
Index: []

In [60]:
pd.read_sql_query("INSERT INTO student values(1,'nhk',24,curdate())", connection)

TypeError: 'NoneType' object is not iterable

In [61]:
pd.read_sql_query("SELECT * FROM student", connection)

   sno sname  age         dob
0    1   nhk   24  2020-05-17

In [62]:
#dropping the table
pd.read_sql_query("DROP TABLE student", connection)

TypeError: 'NoneType' object is not iterable

In [63]:
pd.read_sql_query("SELECT * FROM student", connection)

DatabaseError: Execution failed on sql 'SELECT * FROM student': 1146 (42S02): Table 'imdb.student' doesn't exist

In [64]:
pd.read_sql_query("CREATE TABLE student(sno int, sname varchar(20), age int, dob date)", connection)

TypeError: 'NoneType' object is not iterable

In [66]:
pd.read_sql_query("SELECT * FROM student", connection)

Empty DataFrame
Columns: [sno, sname, age, dob]
Index: []

In [67]:
pd.read_sql_query("DESC student", connection)

   Field         Type Null Key Default Extra
0    sno      int(11)  YES        None
1  sname  varchar(20)  YES        None
2    age      int(11)  YES        None
3    dob         date  YES        None

In [68]:
#ALTER 
pd.read_sql_query("ALTER TABLE student add marks int", connection)

TypeError: 'NoneType' object is not iterable

In [69]:
pd.read_sql_query("DESC student", connection)

   Field         Type Null Key Default Extra
0    sno      int(11)  YES        None
1  sname  varchar(20)  YES        None
2    age      int(11)  YES        None
3    dob         date  YES        None
4  marks      int(11)  YES        None

In [72]:
#dropping a column
pd.read_sql_query("ALTER TABLE student DROP dob", connection)

DatabaseError: Execution failed on sql 'ALTER TABLE student DROP dob': 1091 (42000): Can't DROP 'dob'; check that column/key exists

In [73]:
pd.read_sql_query("DESC student", connection)

   Field         Type Null Key Default Extra
0    sno      int(11)  YES        None
1  sname  varchar(20)  YES        None
2    age      int(11)  YES        None
3  marks      int(11)  YES        None

In [74]:
pd.read_sql_query("ALTER TABLE student ADD subject INT", connection)

TypeError: 'NoneType' object is not iterable

In [75]:
pd.read_sql_query("DESC student", connection)

     Field         Type Null Key Default Extra
0      sno      int(11)  YES        None
1    sname  varchar(20)  YES        None
2      age      int(11)  YES        None
3    marks      int(11)  YES        None
4  subject      int(11)  YES        None

In [79]:
pd.read_sql_query("INSERT INTO student values(2, 'nhk2',25,98,'maths')", connection)
#pd.read_sql_query("INSERT INTO student values(1,'nhk',24,curdate())", connection)

DatabaseError: Execution failed on sql 'INSERT INTO student values(2, 'nhk2',25,98,'maths')': 1366 (HY000): Incorrect integer value: 'maths' for column 'subject' at row 1

In [80]:
pd.read_sql_query("SELECT * FROM student", connection)

Empty DataFrame
Columns: [sno, sname, age, marks, subject]
Index: []

In [81]:
pd.read_sql_query("ALTER TABLE student MODIFY subject varchar(100)", connection)

TypeError: 'NoneType' object is not iterable

In [82]:
pd.read_sql_query("SELECT * FROM student", connection)

Empty DataFrame
Columns: [sno, sname, age, marks, subject]
Index: []

In [83]:
pd.read_sql_query("INSERT INTO student values(2, 'nhk2',25,98,'maths')", connection)

TypeError: 'NoneType' object is not iterable

In [84]:
pd.read_sql_query("SELECT * FROM student", connection)

   sno sname  age  marks subject
0    2  nhk2   25     98   maths

In [85]:
pd.read_sql_query("INSERT INTO student values(3, 'nhk3',23,60,'travel')", connection)

TypeError: 'NoneType' object is not iterable

In [86]:
pd.read_sql_query("SELECT * FROM student", connection)

   sno sname  age  marks subject
0    2  nhk2   25     98   maths
1    3  nhk3   23     60  travel

In [90]:
pd.read_sql_query("ALTER TABLE student MODIFY subject varchar(100) NOT NULL DEFAULT 'history'", connection)

TypeError: 'NoneType' object is not iterable

In [91]:
pd.read_sql_query("DESC student", connection)

     Field          Type Null Key  Default Extra
0      sno       int(11)  YES         None
1    sname   varchar(20)  YES         None
2      age       int(11)  YES         None
3    marks       int(11)  YES         None
4  subject  varchar(100)   NO      history

In [93]:
pd.read_sql_query("ALTER TABLE student ALTER subject SET DEFAULT 'thermodynamics'", connection)

TypeError: 'NoneType' object is not iterable

In [94]:
pd.read_sql_query("DESC student", connection)

     Field          Type Null Key         Default Extra
0      sno       int(11)  YES                None
1    sname   varchar(20)  YES                None
2      age       int(11)  YES                None
3    marks       int(11)  YES                None
4  subject  varchar(100)   NO      thermodynamics

In [95]:
pd.read_sql_query("ALTER TABLE student RENAME to estudent", connection)

TypeError: 'NoneType' object is not iterable

In [98]:
pd.read_sql_query("DESC estudent", connection)

     Field          Type Null Key         Default Extra
0      sno       int(11)  YES                None
1    sname   varchar(20)  YES                None
2      age       int(11)  YES                None
3    marks       int(11)  YES                None
4  subject  varchar(100)   NO      thermodynamics

In [100]:
pd.read_sql_query("SHOW TABLES FROM imdb", connection)
#estudent table is in row index 3

     Tables_in_imdb
0            actors
1         directors
2  directors_genres
3          estudent
4        helloworld
5            movies
6  movies_directors
7     movies_genres
8             roles